MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128GP710/mcu.h
/* C2BUFPNT1 */
/* Bitname _F0BP cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F0BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F1BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F2BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F3BP3 cannot be defined because it is used by more than one SFR */

/* C2RXFUL1 */
/* Bitname _RXFUL0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL6 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL7 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL8 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL9 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL10 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL11 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL12 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL13 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL14 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL15 cannot be defined because it is used by more than one SFR */

/* C2BUFPNT2 */
/* Bitname _F4BP cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F4BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F5BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F6BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F7BP3 cannot be defined because it is used by more than one SFR */

/* C2RXFUL2 */
/* Bitname _RXFUL16 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL17 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL18 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL19 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL20 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL21 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL22 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL23 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL24 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL25 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL26 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL27 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL28 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL29 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL30 cannot be defined because it is used by more than one SFR */
/* Bitname _RXFUL31 cannot be defined because it is used by more than one SFR */

/* C2BUFPNT3 */
/* Bitname _F8BP cannot be defined because it is used by more than one SFR */
/* Bitname _F9BP cannot be defined because it is used by more than one SFR */
/* Bitname _F10BP cannot be defined because it is used by more than one SFR */
/* Bitname _F11BP cannot be defined because it is used by more than one SFR */
/* Bitname _F8BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F8BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F8BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F8BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F9BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F9BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F9BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F9BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F10BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F10BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F10BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F10BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F11BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F11BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F11BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F11BP3 cannot be defined because it is used by more than one SFR */

/* C2BUFPNT4 */
/* Bitname _F12BP cannot be defined because it is used by more than one SFR */
/* Bitname _F13BP cannot be defined because it is used by more than one SFR */
/* Bitname _F14BP cannot be defined because it is used by more than one SFR */
/* Bitname _F15BP cannot be defined because it is used by more than one SFR */
/* Bitname _F12BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F12BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F12BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F12BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F13BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F13BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F13BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F13BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F14BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F14BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F14BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F14BP3 cannot be defined because it is used by more than one SFR */
/* Bitname _F15BP0 cannot be defined because it is used by more than one SFR */
/* Bitname _F15BP1 cannot be defined because it is used by more than one SFR */
/* Bitname _F15BP2 cannot be defined because it is used by more than one SFR */
/* Bitname _F15BP3 cannot be defined because it is used by more than one SFR */

