MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ128GP710/mcu.h
#define _AD2CHS0_CH0SB_POSITION                  0x00000008
#define _AD2CHS0_CH0SB_MASK                      0x00000F00
#define _AD2CHS0_CH0SB_LENGTH                    0x00000004

#define _AD2CHS0_CH0NB_POSITION                  0x0000000F
#define _AD2CHS0_CH0NB_MASK                      0x00008000
#define _AD2CHS0_CH0NB_LENGTH                    0x00000001

#define _AD2CHS0_CH0SA0_POSITION                 0x00000000
#define _AD2CHS0_CH0SA0_MASK                     0x00000001
#define _AD2CHS0_CH0SA0_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA1_POSITION                 0x00000001
#define _AD2CHS0_CH0SA1_MASK                     0x00000002
#define _AD2CHS0_CH0SA1_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA2_POSITION                 0x00000002
#define _AD2CHS0_CH0SA2_MASK                     0x00000004
#define _AD2CHS0_CH0SA2_LENGTH                   0x00000001

#define _AD2CHS0_CH0SA3_POSITION                 0x00000003
#define _AD2CHS0_CH0SA3_MASK                     0x00000008
#define _AD2CHS0_CH0SA3_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB0_POSITION                 0x00000008
#define _AD2CHS0_CH0SB0_MASK                     0x00000100
#define _AD2CHS0_CH0SB0_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB1_POSITION                 0x00000009
#define _AD2CHS0_CH0SB1_MASK                     0x00000200
#define _AD2CHS0_CH0SB1_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB2_POSITION                 0x0000000A
#define _AD2CHS0_CH0SB2_MASK                     0x00000400
#define _AD2CHS0_CH0SB2_LENGTH                   0x00000001

#define _AD2CHS0_CH0SB3_POSITION                 0x0000000B
#define _AD2CHS0_CH0SB3_MASK                     0x00000800
#define _AD2CHS0_CH0SB3_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG0_POSITION                 0x00000000
#define _AD2PCFGL_PCFG0_MASK                     0x00000001
#define _AD2PCFGL_PCFG0_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG1_POSITION                 0x00000001
#define _AD2PCFGL_PCFG1_MASK                     0x00000002
#define _AD2PCFGL_PCFG1_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG2_POSITION                 0x00000002
#define _AD2PCFGL_PCFG2_MASK                     0x00000004
#define _AD2PCFGL_PCFG2_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG3_POSITION                 0x00000003
#define _AD2PCFGL_PCFG3_MASK                     0x00000008
#define _AD2PCFGL_PCFG3_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG4_POSITION                 0x00000004
#define _AD2PCFGL_PCFG4_MASK                     0x00000010
#define _AD2PCFGL_PCFG4_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG5_POSITION                 0x00000005
#define _AD2PCFGL_PCFG5_MASK                     0x00000020
#define _AD2PCFGL_PCFG5_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG6_POSITION                 0x00000006
#define _AD2PCFGL_PCFG6_MASK                     0x00000040
#define _AD2PCFGL_PCFG6_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG7_POSITION                 0x00000007
#define _AD2PCFGL_PCFG7_MASK                     0x00000080
#define _AD2PCFGL_PCFG7_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG8_POSITION                 0x00000008
#define _AD2PCFGL_PCFG8_MASK                     0x00000100
#define _AD2PCFGL_PCFG8_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG9_POSITION                 0x00000009
#define _AD2PCFGL_PCFG9_MASK                     0x00000200
#define _AD2PCFGL_PCFG9_LENGTH                   0x00000001

#define _AD2PCFGL_PCFG10_POSITION                0x0000000A
#define _AD2PCFGL_PCFG10_MASK                    0x00000400
#define _AD2PCFGL_PCFG10_LENGTH                  0x00000001

#define _AD2PCFGL_PCFG11_POSITION                0x0000000B
#define _AD2PCFGL_PCFG11_MASK                    0x00000800
#define _AD2PCFGL_PCFG11_LENGTH                  0x00000001

#define _AD2PCFGL_PCFG12_POSITION                0x0000000C
#define _AD2PCFGL_PCFG12_MASK                    0x00001000
#define _AD2PCFGL_PCFG12_LENGTH                  0x00000001

#define _AD2PCFGL_PCFG13_POSITION                0x0000000D
#define _AD2PCFGL_PCFG13_MASK                    0x00002000
#define _AD2PCFGL_PCFG13_LENGTH                  0x00000001

#define _AD2PCFGL_PCFG14_POSITION                0x0000000E
#define _AD2PCFGL_PCFG14_MASK                    0x00004000
#define _AD2PCFGL_PCFG14_LENGTH                  0x00000001

#define _AD2PCFGL_PCFG15_POSITION                0x0000000F
#define _AD2PCFGL_PCFG15_MASK                    0x00008000
#define _AD2PCFGL_PCFG15_LENGTH                  0x00000001

#define _AD2PCFGL_PCFG_POSITION                  0x00000000
#define _AD2PCFGL_PCFG_MASK                      0x0000FFFF
#define _AD2PCFGL_PCFG_LENGTH                    0x00000010

#define _AD2CSSL_CSSL_POSITION                   0x00000000
#define _AD2CSSL_CSSL_MASK                       0x0000FFFF
#define _AD2CSSL_CSSL_LENGTH                     0x00000010

#define _AD2CSSL_CSS0_POSITION                   0x00000000
#define _AD2CSSL_CSS0_MASK                       0x00000001
#define _AD2CSSL_CSS0_LENGTH                     0x00000001

#define _AD2CSSL_CSS1_POSITION                   0x00000001
#define _AD2CSSL_CSS1_MASK                       0x00000002
#define _AD2CSSL_CSS1_LENGTH                     0x00000001

#define _AD2CSSL_CSS2_POSITION                   0x00000002
#define _AD2CSSL_CSS2_MASK                       0x00000004
#define _AD2CSSL_CSS2_LENGTH                     0x00000001

#define _AD2CSSL_CSS3_POSITION                   0x00000003
#define _AD2CSSL_CSS3_MASK                       0x00000008
#define _AD2CSSL_CSS3_LENGTH                     0x00000001

#define _AD2CSSL_CSS4_POSITION                   0x00000004
#define _AD2CSSL_CSS4_MASK                       0x00000010
#define _AD2CSSL_CSS4_LENGTH                     0x00000001

#define _AD2CSSL_CSS5_POSITION                   0x00000005
#define _AD2CSSL_CSS5_MASK                       0x00000020
#define _AD2CSSL_CSS5_LENGTH                     0x00000001

